def char_to_telex(ch, prev=None):
    ch=ch.lower()
    mapping = {
        'á':'s','à':'f','ả':'r','ã':'x','ạ':'j',
        'ă':'w','ắ':'s','ằ':'f','ẳ':'r','ẵ':'x','ặ':'j',
        'â':'a','ấ':'s','ầ':'f','ẩ':'r','ẫ':'x','ậ':'j',
        'é':'s','è':'f','ẻ':'r','ẽ':'x','ẹ':'j',
        'ê':'e','ế':'s','ề':'f','ể':'r','ễ':'x','ệ':'j',
        'í':'s','ì':'f','ỉ':'r','ĩ':'x','ị':'j',
        'ó':'s','ò':'f','ỏ':'r','õ':'x','ọ':'j',
        'ô':'o','ố':'s','ồ':'f','ổ':'r','ỗ':'x','ộ':'j',
        'ơ':'w','ớ':'s','ờ':'f','ở':'r','ỡ':'x','ợ':'j',
        'ú':'s','ù':'f','ủ':'r','ũ':'x','ụ':'j',
        'ư':'w','ứ':'s','ừ':'f','ử':'r','ữ':'x','ự':'j',
        'ý':'s','ỳ':'f','ỷ':'r','ỹ':'x','ỵ':'j',
        'đ':'d'
    }

    # các trường hợp gõ chồng dấu (ví dụ: á -> ấ)
    special_combo = {
        # â
        ('á','ấ'):'a',('à','ầ'):'a',('ả','ẩ'):'a',('ã','ẫ'):'a',('ạ','ậ'):'a',
        # ă
        ('á','ắ'):'w',('à','ằ'):'w',('ả','ẳ'):'w',('ã','ẵ'):'w',('ạ','ặ'):'w',
        # ê
        ('é','ế'):'e',('è','ề'):'e',('ẻ','ể'):'e',('ẽ','ễ'):'e',('ẹ','ệ'):'e',
        # ô
        ('ó','ố'):'o',('ò','ồ'):'o',('ỏ','ổ'):'o',('õ','ỗ'):'o',('ọ','ộ'):'o',
        # ơ
        ('ó','ớ'):'w',('ò','ờ'):'w',('ỏ','ở'):'w',('õ','ỡ'):'w',('ọ','ợ'):'w',
        # ư
        ('ú','ứ'):'w',('ù','ừ'):'w',('ủ','ử'):'w',('ũ','ữ'):'w',('ụ','ự'):'w'
    }

    if prev and (prev, ch) in special_combo:
        return special_combo[(prev, ch)]

    return mapping.get(ch, ch)
